MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX534F064L.PIC
      <edc:SFRDef edc:_addr="0x1F886170" edc:_begin="0x0" edc:_end="0x40" edc:_modsrc="DOS-01166_TDAA_Ports.Module" edc:_refcount="6" edc:access="------------------nn---n--nnnnnn" edc:cname="ODCF" edc:desc="" edc:grp="PORTF" edc:impl="0xffff313f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------00---0--000000" edc:name="ODCF" edc:nzwidth="0x20" edc:por="------------------00---0--000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODCF0" edc:desc="" edc:mask="0x1" edc:name="ODCF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCF1" edc:desc="" edc:mask="0x1" edc:name="ODCF1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCF2" edc:desc="" edc:mask="0x1" edc:name="ODCF2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCF3" edc:desc="" edc:mask="0x1" edc:name="ODCF3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCF4" edc:desc="" edc:mask="0x1" edc:name="ODCF4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCF5" edc:desc="" edc:mask="0x1" edc:name="ODCF5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCF8" edc:desc="" edc:mask="0x1" edc:name="ODCF8" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCF12" edc:desc="" edc:mask="0x1" edc:name="ODCF12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCF13" edc:desc="" edc:mask="0x1" edc:name="ODCF13" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886180" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-01166_TDAA_PortG.Module" edc:_refcount="1" edc:access="----------------nnnn--nnnn--11nn" edc:cname="TRISG" edc:desc="" edc:grp="PORTG" edc:impl="0xfffff3cf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1111--1111--1111" edc:name="TRISG" edc:nzwidth="0x20" edc:por="----------------1111--1111--1111" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRISG0" edc:desc="" edc:mask="0x1" edc:name="TRISG0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISG1" edc:desc="" edc:mask="0x1" edc:name="TRISG1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISG2" edc:desc="" edc:mask="0x1" edc:name="TRISG2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISG3" edc:desc="" edc:mask="0x1" edc:name="TRISG3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISG6" edc:desc="" edc:mask="0x1" edc:name="TRISG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISG7" edc:desc="" edc:mask="0x1" edc:name="TRISG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISG8" edc:desc="" edc:mask="0x1" edc:name="TRISG8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISG9" edc:desc="" edc:mask="0x1" edc:name="TRISG9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISG12" edc:desc="" edc:mask="0x1" edc:name="TRISG12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISG13" edc:desc="" edc:mask="0x1" edc:name="TRISG13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISG14" edc:desc="" edc:mask="0x1" edc:name="TRISG14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISG15" edc:desc="" edc:mask="0x1" edc:name="TRISG15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886190" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-01166_TDAA_PortG.Module" edc:_refcount="1" edc:access="----------------nnnn--nnnn--nnnn" edc:cname="PORTG" edc:desc="" edc:grp="PORTG" edc:impl="0xfffff3cf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxx--xxxx--xxxx" edc:name="PORTG" edc:nzwidth="0x20" edc:por="----------------xxxx--xxxx--xxxx" edc:portals="CLR SET INV" ltx:baseofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RG0" edc:desc="" edc:mask="0x1" edc:name="RG0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RG1" edc:desc="" edc:mask="0x1" edc:name="RG1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RG2" edc:desc="" edc:mask="0x1" edc:name="RG2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RG3" edc:desc="" edc:mask="0x1" edc:name="RG3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RG6" edc:desc="" edc:mask="0x1" edc:name="RG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RG7" edc:desc="" edc:mask="0x1" edc:name="RG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RG8" edc:desc="" edc:mask="0x1" edc:name="RG8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RG9" edc:desc="" edc:mask="0x1" edc:name="RG9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RG12" edc:desc="" edc:mask="0x1" edc:name="RG12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RG13" edc:desc="" edc:mask="0x1" edc:name="RG13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RG14" edc:desc="" edc:mask="0x1" edc:name="RG14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RG15" edc:desc="" edc:mask="0x1" edc:name="RG15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8861A0" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-01166_TDAA_PortG.Module" edc:_refcount="1" edc:access="----------------nnnn--nnnn--rrnn" edc:cname="LATG" edc:desc="" edc:grp="PORTG" edc:impl="0xfffff3cf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxx--xxxx--xxxx" edc:name="LATG" edc:nzwidth="0x20" edc:por="----------------xxxx--xxxx--xxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LATG0" edc:desc="" edc:mask="0x1" edc:name="LATG0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATG1" edc:desc="" edc:mask="0x1" edc:name="LATG1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATG2" edc:desc="" edc:mask="0x1" edc:name="LATG2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATG3" edc:desc="" edc:mask="0x1" edc:name="LATG3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATG6" edc:desc="" edc:mask="0x1" edc:name="LATG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATG7" edc:desc="" edc:mask="0x1" edc:name="LATG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATG8" edc:desc="" edc:mask="0x1" edc:name="LATG8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATG9" edc:desc="" edc:mask="0x1" edc:name="LATG9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATG12" edc:desc="" edc:mask="0x1" edc:name="LATG12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATG13" edc:desc="" edc:mask="0x1" edc:name="LATG13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATG14" edc:desc="" edc:mask="0x1" edc:name="LATG14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATG15" edc:desc="" edc:mask="0x1" edc:name="LATG15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8861B0" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-01166_TDAA_PortG.Module" edc:_refcount="1" edc:access="----------------nnnn--nnnn--rrnn" edc:cname="ODCG" edc:desc="" edc:grp="PORTG" edc:impl="0xfffff3cf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000--0000--0000" edc:name="ODCG" edc:nzwidth="0x20" edc:por="----------------0000--0000--0000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODCG0" edc:desc="" edc:mask="0x1" edc:name="ODCG0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCG1" edc:desc="" edc:mask="0x1" edc:name="ODCG1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCG2" edc:desc="" edc:mask="0x1" edc:name="ODCG2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCG3" edc:desc="" edc:mask="0x1" edc:name="ODCG3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCG6" edc:desc="" edc:mask="0x1" edc:name="ODCG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCG7" edc:desc="" edc:mask="0x1" edc:name="ODCG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCG8" edc:desc="" edc:mask="0x1" edc:name="ODCG8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCG9" edc:desc="" edc:mask="0x1" edc:name="ODCG9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCG12" edc:desc="" edc:mask="0x1" edc:name="ODCG12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCG13" edc:desc="" edc:mask="0x1" edc:name="ODCG13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCG14" edc:desc="" edc:mask="0x1" edc:name="ODCG14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCG15" edc:desc="" edc:mask="0x1" edc:name="ODCG15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8861C0" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-01166_TDAA_PortG.Module" edc:_refcount="1" edc:access="----------------n-n-------------" edc:cname="CNCON" edc:desc="" edc:grp="PORTG" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CNCON" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="13"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8861D0" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-01166_TDAA_PortG.Module" edc:_refcount="1" edc:access="----------nnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNEN" edc:desc="" edc:grp="PORTG" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CNEN" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNEN0" edc:desc="" edc:mask="0x1" edc:name="CNEN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN1" edc:desc="" edc:mask="0x1" edc:name="CNEN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN2" edc:desc="" edc:mask="0x1" edc:name="CNEN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN3" edc:desc="" edc:mask="0x1" edc:name="CNEN3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN4" edc:desc="" edc:mask="0x1" edc:name="CNEN4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN5" edc:desc="" edc:mask="0x1" edc:name="CNEN5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN6" edc:desc="" edc:mask="0x1" edc:name="CNEN6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN7" edc:desc="" edc:mask="0x1" edc:name="CNEN7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN8" edc:desc="" edc:mask="0x1" edc:name="CNEN8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN9" edc:desc="" edc:mask="0x1" edc:name="CNEN9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN10" edc:desc="" edc:mask="0x1" edc:name="CNEN10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN11" edc:desc="" edc:mask="0x1" edc:name="CNEN11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN12" edc:desc="" edc:mask="0x1" edc:name="CNEN12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN13" edc:desc="" edc:mask="0x1" edc:name="CNEN13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN14" edc:desc="" edc:mask="0x1" edc:name="CNEN14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN15" edc:desc="" edc:mask="0x1" edc:name="CNEN15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN16" edc:desc="" edc:mask="0x1" edc:name="CNEN16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN17" edc:desc="" edc:mask="0x1" edc:name="CNEN17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN18" edc:desc="" edc:mask="0x1" edc:name="CNEN18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN19" edc:desc="" edc:mask="0x1" edc:name="CNEN19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN20" edc:desc="" edc:mask="0x1" edc:name="CNEN20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN21" edc:desc="" edc:mask="0x1" edc:name="CNEN21" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8861E0" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-01166_TDAA_PortG.Module" edc:_refcount="1" edc:access="----------nnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNPUE" edc:desc="" edc:grp="PORTG" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CNPUE" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUE0" edc:desc="" edc:mask="0x1" edc:name="CNPUE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE1" edc:desc="" edc:mask="0x1" edc:name="CNPUE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE2" edc:desc="" edc:mask="0x1" edc:name="CNPUE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE3" edc:desc="" edc:mask="0x1" edc:name="CNPUE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE4" edc:desc="" edc:mask="0x1" edc:name="CNPUE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE5" edc:desc="" edc:mask="0x1" edc:name="CNPUE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE6" edc:desc="" edc:mask="0x1" edc:name="CNPUE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE7" edc:desc="" edc:mask="0x1" edc:name="CNPUE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE8" edc:desc="" edc:mask="0x1" edc:name="CNPUE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE9" edc:desc="" edc:mask="0x1" edc:name="CNPUE9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE10" edc:desc="" edc:mask="0x1" edc:name="CNPUE10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE11" edc:desc="" edc:mask="0x1" edc:name="CNPUE11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE12" edc:desc="" edc:mask="0x1" edc:name="CNPUE12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE13" edc:desc="" edc:mask="0x1" edc:name="CNPUE13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE14" edc:desc="" edc:mask="0x1" edc:name="CNPUE14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE15" edc:desc="" edc:mask="0x1" edc:name="CNPUE15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE16" edc:desc="" edc:mask="0x1" edc:name="CNPUE16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE17" edc:desc="" edc:mask="0x1" edc:name="CNPUE17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE18" edc:desc="" edc:mask="0x1" edc:name="CNPUE18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE19" edc:desc="" edc:mask="0x1" edc:name="CNPUE19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE20" edc:desc="" edc:mask="0x1" edc:name="CNPUE20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE21" edc:desc="" edc:mask="0x1" edc:name="CNPUE21" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x1f889000" edc:endaddr="0x1f88a000" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="periph3"/>
    <edc:SFRDataSector edc:beginaddr="0x1f88b000" edc:endaddr="0x1f88d000" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="periph4">
      <edc:SFRDef edc:_addr="0x1F88B000" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="----snnnrrrn----n-n-r------nnnnn" edc:cname="C1CON" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----01001000----0-0-0------00000" edc:name="C1CON" edc:nzwidth="0x20" edc:por="----01001000----0-0-0------00000" edc:portals="CLR SET INV" ltx:baseofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DNCNT" edc:desc="" edc:mask="0x1f" edc:name="DNCNT" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="CANBUSY" edc:desc="" edc:mask="0x1" edc:name="CANBUSY" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="CANCAP" edc:desc="" edc:mask="0x1" edc:name="CANCAP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OPMOD" edc:desc="" edc:mask="0x7" edc:name="OPMOD" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="REQOP" edc:desc="" edc:mask="0x7" edc:name="REQOP" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="ABAT" edc:desc="" edc:mask="0x1" edc:name="ABAT" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="4"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CAN1" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F88B010" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="---------n---nnnnnnnnnnnnnnnnnnn" edc:cname="C1CFG" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------0---0000000000000000000" edc:name="C1CFG" edc:nzwidth="0x20" edc:por="---------0---0000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BRP" edc:desc="" edc:mask="0x3f" edc:name="BRP" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="SJW" edc:desc="" edc:mask="0x3" edc:name="SJW" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PRSEG" edc:desc="" edc:mask="0x7" edc:name="PRSEG" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="SEG1PH" edc:desc="" edc:mask="0x7" edc:name="SEG1PH" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="SAM" edc:desc="" edc:mask="0x1" edc:name="SAM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SEG2PHTS" edc:desc="" edc:mask="0x1" edc:name="SEG2PHTS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SEG2PH" edc:desc="" edc:mask="0x7" edc:name="SEG2PH" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="WAKFIL" edc:desc="" edc:mask="0x1" edc:name="WAKFIL" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
